In [41]:
import pandas as pd
import numpy as np
from sklearn.metrics import mean_absolute_error, mean_squared_error, max_error, median_absolute_error, r2_score, explained_variance_score

In [71]:
# train.csv
train_df = pd.read_csv("train.csv")
train_df.head()

         date  store  item  sales
0  2013-01-01      1     1     13
1  2013-01-02      1     1     11
2  2013-01-03      1     1     14
3  2013-01-04      1     1     13
4  2013-01-05      1     1     10

In [43]:
# test.csv
test_df = pd.read_csv("test.csv")
test_df.head()

   id        date  store  item
0   0  2018-01-01      1     1
1   1  2018-01-02      1     1
2   2  2018-01-03      1     1
3   3  2018-01-04      1     1
4   4  2018-01-05      1     1

In [44]:
# sample_submission.csv
sample_df = pd.read_csv("sample_submission.csv")
sample_df.head()

   id  sales
0   0     52
1   1     52
2   2     52
3   3     52
4   4     52

In [45]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 913000 entries, 0 to 912999
Data columns (total 4 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   date    913000 non-null  object
 1   store   913000 non-null  int64
 2   item    913000 non-null  int64
 3   sales   913000 non-null  int64
dtypes: int64(3), object(1)
memory usage: 27.9+ MB

In [46]:
train_df.shape

(913000, 4)

In [47]:
train_df.store.value_counts()

1     91300
2     91300
3     91300
4     91300
5     91300
6     91300
7     91300
8     91300
9     91300
10    91300
Name: store, dtype: int64

In [48]:
train_df.isnull().sum().sum()

0

In [49]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 45000 entries, 0 to 44999
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      45000 non-null  int64
 1   date    45000 non-null  object
 2   store   45000 non-null  int64
 3   item    45000 non-null  int64
dtypes: int64(3), object(1)
memory usage: 1.4+ MB

In [50]:
test_df.shape

(45000, 4)

In [51]:
test_df.store.value_counts()

1     4500
2     4500
3     4500
4     4500
5     4500
6     4500
7     4500
8     4500
9     4500
10    4500
Name: store, dtype: int64

In [52]:
test_df.isnull().sum().sum()

0

# Data Preparation

In [62]:
from datetime import datetime

def convertYMD(df):
    df['date'] = pd.to_datetime(df['date'])
    df['year'] = [i.year for i in df['date']]
    df['month'] = [i.month for i in df['date']]
    df['day'] = [i.dayofweek for i in df['date']]
    
    df.drop('date', axis=1, inplace=True)

In [72]:
convertYMD(train_df)
train_df.head()

   store  item  sales  year  month  day
0      1     1     13  2013      1    1
1      1     1     11  2013      1    2
2      1     1     14  2013      1    3
3      1     1     13  2013      1    4
4      1     1     10  2013      1    5

In [73]:
train_df.year.value_counts()

2016    183000
2013    182500
2014    182500
2015    182500
2017    182500
Name: year, dtype: int64

In [74]:
train_df.month.value_counts()

1     77500
3     77500
5     77500
7     77500
8     77500
10    77500
12    77500
4     75000
6     75000
9     75000
11    75000
2     70500
Name: month, dtype: int64

In [75]:
train_df.day.value_counts().sort_index()

0    130000
1    130500
2    130500
3    130500
4    130500
5    130500
6    130500
Name: day, dtype: int64

In [76]:
train_df.item.value_counts().sort_index()

1     18260
2     18260
3     18260
4     18260
5     18260
6     18260
7     18260
8     18260
9     18260
10    18260
11    18260
12    18260
13    18260
14    18260
15    18260
16    18260
17    18260
18    18260
19    18260
20    18260
21    18260
22    18260
23    18260
24    18260
25    18260
26    18260
27    18260
28    18260
29    18260
30    18260
31    18260
32    18260
33    18260
34    18260
35    18260
36    18260
37    18260
38    18260
39    18260
40    18260
41    18260
42    18260
43    18260
44    18260
45    18260
46    18260
47    18260
48    18260
49    18260
50    18260
Name: item, dtype: int64

In [77]:
train_df.sales.value_counts().sort_index()

0        1
1        4
2       25
3       91
4      215
      ...
208      1
209      1
210      1
214      1
231      1
Name: sales, Length: 213, dtype: int64

In [78]:
sales = train_df.pop('sales') 
sales.head()

0    13
1    11
2    14
3    13
4    10
Name: sales, dtype: int64

In [80]:
# drop id column
test_df.drop('id', axis=1, inplace=True)

In [81]:
convertYMD(test_df)
test_df.head()

   store  item  year  month  day
0      1     1  2018      1    0
1      1     1  2018      1    1
2      1     1  2018      1    2
3      1     1  2018      1    3
4      1     1  2018      1    4

In [82]:
test_df.year.value_counts()

2018    45000
Name: year, dtype: int64

In [85]:
test_df.month.value_counts()

1    15500
3    15500
2    14000
Name: month, dtype: int64

In [86]:
test_df.day.value_counts()

0    6500
1    6500
2    6500
3    6500
4    6500
5    6500
6    6000
Name: day, dtype: int64

In [83]:
test_df.item.value_counts().sort_index()

1     900
2     900
3     900
4     900
5     900
6     900
7     900
8     900
9     900
10    900
11    900
12    900
13    900
14    900
15    900
16    900
17    900
18    900
19    900
20    900
21    900
22    900
23    900
24    900
25    900
26    900
27    900
28    900
29    900
30    900
31    900
32    900
33    900
34    900
35    900
36    900
37    900
38    900
39    900
40    900
41    900
42    900
43    900
44    900
45    900
46    900
47    900
48    900
49    900
50    900
Name: item, dtype: int64

In [84]:
test_df.store.value_counts().sort_index()

1     4500
2     4500
3     4500
4     4500
5     4500
6     4500
7     4500
8     4500
9     4500
10    4500
Name: store, dtype: int64